app/controllers/contact_controller.rb

  def send_contact
    @name = params[:name]
    @mail = params[:email]
    @comment = params[:comment]

    c = Contact.new
    c.name = @name
    c.mail = @mail
    c.comment = @comment
    c.save
---
INSERT INTO `contacts` (`comment`, `created_at`, `mail`, `name`, `updated_at`) VALUES ('wfsfsdfsdfsdfsdf', '2014-09-12 00:24:04', 'teohoch2@gmail.com', 'Teodoro Hochfärber', '2014-09-12 00:24:04')