app/controllers/welcome_controller.rb

INSERT INTO `subscribers` (`created_at`, `email`, `name`, `updated_at`) VALUES ('2014-09-09 20:10:09', 'te@sdf.cl', 'hjhj', '2014-09-09 20:10:09')
SELECT  1 AS one FROM `subscribers`  WHERE `subscribers`.`email` = BINARY 'teohoch2@gmail.com' LIMIT 1
---
  def new_subscriber
    @name = params[:name]
    @mail = params[:email]

    s = Subscriber.new
    s.name = @name
    s.email = @mail
    s.save

    if s.errors.any?